chafood/app/controllers/orders_controller.rb

INSERT INTO "orders" ("name", "phone_number", "total_value", "city", "neighborhood", "number", "complement", "restaurant_id", "created_at", "updated_at", "street") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)
    if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_order
    @order = Order.find(params[:id])