chafood/app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    @restaurants = Restaurant.all

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def set_restaurant
    @restaurant = Restaurant.find(params[:id])